In [19]:
import re
import pandas as pd
import numpy as np
import seaborn as sns

## Data cleaning

In [4]:
# Load data
df = pd.read_csv('datasets/num_plates.csv')
df

                 Plates  Number Code       Price
0      274 I 215,000AED     274    I  215,000AED
1     78888 H 72,000AED   78888    H   72,000AED
2      6777 K 72,000AED    6777    K   72,000AED
3      3334 R 72,000AED    3334    R   72,000AED
4     22232 N 41,000AED   22232    N   41,000AED
...                 ...     ...  ...         ...
1452   98828 U 2,400AED   98828    U    2,400AED
1453   99232 U 2,400AED   99232    U    2,400AED
1454   99373 U 2,400AED   99373    U    2,400AED
1455   99585 U 2,400AED   99585    U    2,400AED
1456   99646 U 2,400AED   99646    U    2,400AED

[1457 rows x 4 columns]

In [8]:
# Rename columns, turn into lower case
df = df.rename(columns = {old_name:old_name.lower() for old_name in df.columns})
df

                 plates  number code       price
0      274 I 215,000AED     274    I  215,000AED
1     78888 H 72,000AED   78888    H   72,000AED
2      6777 K 72,000AED    6777    K   72,000AED
3      3334 R 72,000AED    3334    R   72,000AED
4     22232 N 41,000AED   22232    N   41,000AED
...                 ...     ...  ...         ...
1452   98828 U 2,400AED   98828    U    2,400AED
1453   99232 U 2,400AED   99232    U    2,400AED
1454   99373 U 2,400AED   99373    U    2,400AED
1455   99585 U 2,400AED   99585    U    2,400AED
1456   99646 U 2,400AED   99646    U    2,400AED

[1457 rows x 4 columns]

In [9]:
# keep only columns we want.
df = df[['number', 'code', 'price']]
df

      number code       price
0        274    I  215,000AED
1      78888    H   72,000AED
2       6777    K   72,000AED
3       3334    R   72,000AED
4      22232    N   41,000AED
...      ...  ...         ...
1452   98828    U    2,400AED
1453   99232    U    2,400AED
1454   99373    U    2,400AED
1455   99585    U    2,400AED
1456   99646    U    2,400AED

[1457 rows x 3 columns]

In [ ]:
# Remove AED and commans from price
plates['Price'] = plates['Price'].apply(lambda x: re.sub(r"[a-zA-Z,]",'',x)).astype(int)